package org.example.homework.lesson2;
/*
Написать программу, которая выводит на экран остаток от деления двух чисел
 */
public class DivisionRemainder {
    private static final int FIRST_NUM = 10;
    private static final int SECOND_NUM = 3;

    public static void main(String[] args) {
        System.out.println("Division remainder = " + FIRST_NUM % SECOND_NUM);
    }
}
