package org.example.homework.lesson2;
/*
Написать программу, которая выводит на экран произведение двух чисел
 */

public class Multiplication {
    private static final int FIRST_NUM = 87;
    private static final int SECOND_NUM = 456;

    public static void main(String[] args) {
        System.out.println("Multiplication = " + FIRST_NUM * SECOND_NUM);
    }
}
