package org.example.homework.lesson2;

/*
Написать программу, которая выводит на экран результат сложения двух строк
 */
public class StringAddition {
    private static final String FIRST_STRING = "12";
    private static final String SECOND_STRING = "899";

    public static void main(String[] args) {
        System.out.println("Addition result = " + FIRST_STRING + SECOND_STRING);
    }
}
